#+TITLE: Speed measurements

* Protocol

Use latexmk with pdflatex. Measure with -t option.

* Test 1

** Protocol

Write n lines, each containing $\vectormacro{v}\par$.

** Results

|---------------------------+--------+-----------+-----------+----------+--------------+-------|
| macro                     |      n | run 1 (s) | run 2 (s) | mean (s) | mean/n (mus) | ratio |
|---------------------------+--------+-----------+-----------+----------+--------------+-------|
| \vec                      | 100000 |     10.01 |     10.82 |    10.41 |          104 |  0.09 |
| \overrightarrow (amsmath) |  10000 |      9.34 |      9.31 |     9.32 |          932 |  0.84 |
| \vv (esvect)              |  10000 |      9.53 |      9.47 |     9.50 |          950 |  0.86 |
|---------------------------+--------+-----------+-----------+----------+--------------+-------|
| \amsvec                   |  10000 |     11.19 |     10.86 |    11.03 |         1103 |  1.00 |
| \vv                       |  10000 |      11.2 |     11.13 |    11.16 |         1116 |  1.01 |
| \tikzvec                  |   1000 |      9.79 |      9.58 |     9.69 |         9690 |  8.79 |
| \pstricksvec              |   1000 |     10.03 |      9.76 |     9.89 |         9890 |  8.97 |
| \picvec                   |  10000 |     17.85 |     18.57 |    18.21 |         1821 |  1.65 |
|---------------------------+--------+-----------+-----------+----------+--------------+-------|
#+TBLFM: $5=vmean($3..$4);%.2f::$6=($5/$2)*1e6;%.0f::$7=$6/@5$6;%.2f

* Test 2

** Protocol

Run n times \TestOverArrow{vectormacro}.

** Results

|---------------------------+------+-----------+-----------+----------+-------------+-------|
| macro                     |    n | run 1 (s) | run 2 (s) | mean (s) | mean/n (ms) | ratio |
|---------------------------+------+-----------+-----------+----------+-------------+-------|
| \overrightarrow (amsmath) | 1000 |     16.18 |     15.72 |    15.95 |        15.9 |  0.85 |
| \vv (esvect)              | 1000 |     16.08 |        16 |    16.04 |        16.0 |  0.86 |
|---------------------------+------+-----------+-----------+----------+-------------+-------|
| \vv                       | 1000 |      18.8 |     18.38 |    18.59 |        18.6 |  1.00 |
| \tikzvec                  |  100 |     14.77 |     14.79 |    14.78 |       147.8 |  7.95 |
| \pstricksvec              |  100 |     14.12 |     14.09 |    14.11 |       141.1 |  7.59 |
| \picvec                   |  500 |        15 |     14.84 |    14.92 |        29.8 |  1.60 |
|---------------------------+------+-----------+-----------+----------+-------------+-------|
#+TBLFM: $5=vmean($3..$4);%.2f::$6=($5/$2)*1e3;%.1f::$7=$6/@4$6;%.2f

* Comments

 - \vec ~10 times faster than overarrows symb.
 - original amsmath \overrigtharrow and esvect \vv slighty faster.
 - tikz and pstricks methods ~10 times slower than symb.
 - picture method ~2 times slower than symb.

